app/controllers/articles_controller.rb

  def index
    @articles = Article.search(params[:search])
---
SELECT "articles".* FROM "articles"